; ModuleID = 'vsftpd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.vsf_session = type { %struct.vsf_sysutil_sockaddr*, %struct.vsf_sysutil_sockaddr*, i8*, i32, i32, i32, %struct.vsf_sysutil_sockaddr*, i32, i32, i32, i64, i64, i32, i32, %struct.mystr, %struct.mystr, i64, i32, %struct.mystr, i32, i32, i32, %struct.mystr, %struct.mystr_list*, i32, i32, i32, %struct.mystr, %struct.mystr, %struct.mystr, %struct.mystr, i32, i32, i32, %struct.mystr, i64, i64, i64, %struct.mystr, i64, %struct.mystr, %struct.mystr, i32, i32, i32, i32, %struct.mystr, i32, i32, i8*, i8*, i8*, %struct.mystr, i32, i32, i32, i32 }
%struct.vsf_sysutil_sockaddr = type { %union.anon.114 }
%union.anon.114 = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.mystr_list = type { i32, i32, %struct.mystr_list_node* }
%struct.mystr_list_node = type { %struct.mystr, %struct.mystr }
%struct.mystr = type { i8*, i32, i32 }
%struct.vsf_sysutil_statbuf = type opaque
%struct.parseconf_str_setting = type { i8*, i8** }
%struct.parseconf_bool_setting = type { i8*, i32* }
%struct.hash = type { i32, i32, i32, i32 (i32, i8*)*, %struct.hash_node** }
%struct.hash_node = type { i8*, i8*, %struct.hash_node*, %struct.hash_node* }
%struct.vsf_sysutil_sig_details = type { void (i8*)*, i8*, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s_the_str", scope: !2, file: !3, line: 98, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ftp_write_text_common", scope: !3, file: !3, line: 94, type: !4, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, retainedNodes: !128)
!3 = !DIFile(filename: "ftpcmdio.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !19, !88, !17}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_session", file: !8, line: 18, size: 3840, elements: !9)
!8 = !DIFile(filename: "./session.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!9 = !{!10, !14, !15, !18, !20, !21, !22, !23, !24, !25, !27, !29, !30, !31, !32, !39, !40, !44, !45, !46, !47, !48, !49, !50, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !81, !82, !83, !84, !85, !86, !87}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_addr", scope: !7, file: !8, line: 21, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_sockaddr", file: !13, line: 210, flags: DIFlagFwdDecl)
!13 = !DIFile(filename: "./sysutil.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!14 = !DIDerivedType(tag: DW_TAG_member, name: "p_remote_addr", scope: !7, file: !8, line: 22, baseType: !11, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_line_buf", scope: !7, file: !8, line: 23, baseType: !16, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !7, file: !8, line: 24, baseType: !19, size: 32, offset: 192)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "data_timeout", scope: !7, file: !8, line: 25, baseType: !19, size: 32, offset: 224)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_listen_fd", scope: !7, file: !8, line: 28, baseType: !19, size: 32, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "p_port_sockaddr", scope: !7, file: !8, line: 29, baseType: !11, size: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "data_fd", scope: !7, file: !8, line: 30, baseType: !19, size: 32, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data_progress", scope: !7, file: !8, line: 31, baseType: !19, size: 32, offset: 416)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "bw_rate_max", scope: !7, file: !8, line: 32, baseType: !26, size: 32, offset: 448)
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_sec", scope: !7, file: !8, line: 33, baseType: !28, size: 64, offset: 512)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_usec", scope: !7, file: !8, line: 34, baseType: !28, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "is_anonymous", scope: !7, file: !8, line: 37, baseType: !19, size: 32, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "is_guest", scope: !7, file: !8, line: 38, baseType: !19, size: 32, offset: 672)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "user_str", scope: !7, file: !8, line: 39, baseType: !33, size: 128, offset: 704)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !35)
!34 = !DIFile(filename: "./str.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_buf", scope: !33, file: !34, line: 12, baseType: !16, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_len", scope: !33, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_bytes", scope: !33, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "anon_pass_str", scope: !7, file: !8, line: 40, baseType: !33, size: 128, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "restart_pos", scope: !7, file: !8, line: 43, baseType: !41, size: 64, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "filesize_t", file: !42, line: 4, baseType: !43)
!42 = !DIFile(filename: "./filesize.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!43 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "is_ascii", scope: !7, file: !8, line: 44, baseType: !19, size: 32, offset: 1024)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rnfr_filename_str", scope: !7, file: !8, line: 45, baseType: !33, size: 128, offset: 1088)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "abor_received", scope: !7, file: !8, line: 46, baseType: !19, size: 32, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "epsv_all", scope: !7, file: !8, line: 47, baseType: !19, size: 32, offset: 1248)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "is_http", scope: !7, file: !8, line: 50, baseType: !19, size: 32, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "http_get_arg", scope: !7, file: !8, line: 51, baseType: !33, size: 128, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "p_visited_dir_list", scope: !7, file: !8, line: 54, baseType: !51, size: 64, offset: 1472)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "mystr_list", file: !8, line: 13, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "anon_ftp_uid", scope: !7, file: !8, line: 57, baseType: !19, size: 32, offset: 1536)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "guest_user_uid", scope: !7, file: !8, line: 58, baseType: !19, size: 32, offset: 1568)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "anon_upload_chown_uid", scope: !7, file: !8, line: 59, baseType: !19, size: 32, offset: 1600)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "banned_email_str", scope: !7, file: !8, line: 62, baseType: !33, size: 128, offset: 1664)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "email_passwords_str", scope: !7, file: !8, line: 63, baseType: !33, size: 128, offset: 1792)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "userlist_str", scope: !7, file: !8, line: 64, baseType: !33, size: 128, offset: 1920)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "banner_str", scope: !7, file: !8, line: 65, baseType: !33, size: 128, offset: 2048)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_wrapper_ok", scope: !7, file: !8, line: 66, baseType: !19, size: 32, offset: 2176)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "xferlog_fd", scope: !7, file: !8, line: 69, baseType: !19, size: 32, offset: 2208)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "vsftpd_log_fd", scope: !7, file: !8, line: 70, baseType: !19, size: 32, offset: 2240)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip_str", scope: !7, file: !8, line: 71, baseType: !33, size: 128, offset: 2304)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "log_type", scope: !7, file: !8, line: 72, baseType: !65, size: 64, offset: 2432)
!65 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_sec", scope: !7, file: !8, line: 73, baseType: !28, size: 64, offset: 2496)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_usec", scope: !7, file: !8, line: 74, baseType: !28, size: 64, offset: 2560)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "log_str", scope: !7, file: !8, line: 75, baseType: !33, size: 128, offset: 2624)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_size", scope: !7, file: !8, line: 76, baseType: !41, size: 64, offset: 2752)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_cmd_str", scope: !7, file: !8, line: 79, baseType: !33, size: 128, offset: 2816)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_arg_str", scope: !7, file: !8, line: 80, baseType: !33, size: 128, offset: 2944)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "parent_fd", scope: !7, file: !8, line: 83, baseType: !19, size: 32, offset: 3072)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "child_fd", scope: !7, file: !8, line: 84, baseType: !19, size: 32, offset: 3104)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "num_clients", scope: !7, file: !8, line: 87, baseType: !26, size: 32, offset: 3136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "num_this_ip", scope: !7, file: !8, line: 88, baseType: !26, size: 32, offset: 3168)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "home_str", scope: !7, file: !8, line: 89, baseType: !33, size: 128, offset: 3200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "control_use_ssl", scope: !7, file: !8, line: 92, baseType: !19, size: 32, offset: 3328)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data_use_ssl", scope: !7, file: !8, line: 93, baseType: !19, size: 32, offset: 3360)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "p_ssl_ctx", scope: !7, file: !8, line: 94, baseType: !80, size: 64, offset: 3392)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_ssl", scope: !7, file: !8, line: 95, baseType: !80, size: 64, offset: 3456)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p_data_ssl", scope: !7, file: !8, line: 96, baseType: !80, size: 64, offset: 3520)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "control_cert_digest", scope: !7, file: !8, line: 97, baseType: !33, size: 128, offset: 3584)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_active", scope: !7, file: !8, line: 98, baseType: !19, size: 32, offset: 3712)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_fd", scope: !7, file: !8, line: 99, baseType: !19, size: 32, offset: 3744)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_consumer_fd", scope: !7, file: !8, line: 100, baseType: !19, size: 32, offset: 3776)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "login_fails", scope: !7, file: !8, line: 101, baseType: !26, size: 32, offset: 3808)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!90 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !91, retainedTypes: !121, globals: !122)
!91 = !{!92, !108, !113}
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EVSFLogEntryType", file: !93, line: 8, size: 32, elements: !94)
!93 = !DIFile(filename: "./logging.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!95 = !DIEnumerator(name: "kVSFLogEntryNull", value: 1)
!96 = !DIEnumerator(name: "kVSFLogEntryDownload", value: 2)
!97 = !DIEnumerator(name: "kVSFLogEntryUpload", value: 3)
!98 = !DIEnumerator(name: "kVSFLogEntryMkdir", value: 4)
!99 = !DIEnumerator(name: "kVSFLogEntryLogin", value: 5)
!100 = !DIEnumerator(name: "kVSFLogEntryFTPInput", value: 6)
!101 = !DIEnumerator(name: "kVSFLogEntryFTPOutput", value: 7)
!102 = !DIEnumerator(name: "kVSFLogEntryConnection", value: 8)
!103 = !DIEnumerator(name: "kVSFLogEntryDelete", value: 9)
!104 = !DIEnumerator(name: "kVSFLogEntryRename", value: 10)
!105 = !DIEnumerator(name: "kVSFLogEntryRmdir", value: 11)
!106 = !DIEnumerator(name: "kVSFLogEntryChmod", value: 12)
!107 = !DIEnumerator(name: "kVSFLogEntryDebug", value: 13)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EVSFRWTarget", file: !109, line: 7, size: 32, elements: !110)
!109 = !DIFile(filename: "./readwrite.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "kVSFRWControl", value: 1)
!112 = !DIEnumerator(name: "kVSFRWData", value: 2)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EVSFSysUtilSignal", file: !13, line: 26, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120}
!115 = !DIEnumerator(name: "kVSFSysUtilSigALRM", value: 1)
!116 = !DIEnumerator(name: "kVSFSysUtilSigTERM", value: 2)
!117 = !DIEnumerator(name: "kVSFSysUtilSigCHLD", value: 3)
!118 = !DIEnumerator(name: "kVSFSysUtilSigPIPE", value: 4)
!119 = !DIEnumerator(name: "kVSFSysUtilSigURG", value: 5)
!120 = !DIEnumerator(name: "kVSFSysUtilSigHUP", value: 6)
!121 = !{!65, !6}
!122 = !{!123, !129, !0, !135, !142}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "s_the_str", scope: !125, file: !3, line: 64, type: !33, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "vsf_cmdio_write_raw", scope: !3, file: !3, line: 62, type: !126, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !6, !88}
!128 = !{}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "s_log_str", scope: !131, file: !3, line: 200, type: !33, isLocal: true, isDefinition: true)
!131 = distinct !DISubprogram(name: "vsf_cmdio_get_cmd_and_arg", scope: !3, file: !3, line: 163, type: !132, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !128)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !6, !134, !134, !19}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "s_write_buf_str", scope: !137, file: !3, line: 121, type: !33, isLocal: true, isDefinition: true)
!137 = distinct !DISubprogram(name: "ftp_write_str_common", scope: !3, file: !3, line: 118, type: !138, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, retainedNodes: !128)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !6, !19, !17, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "s_text_mangle_str", scope: !137, file: !3, line: 122, type: !33, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "s_src_str", scope: !146, file: !147, line: 143, type: !170, isLocal: true, isDefinition: true)
!146 = distinct !DISubprogram(name: "process_post_login", scope: !147, file: !147, line: 84, type: !148, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !217, retainedNodes: !128)
!147 = !DIFile(filename: "postlogin.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!148 = !DISubroutineType(types: !149)
!149 = !{null, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_session", file: !8, line: 18, size: 3840, elements: !152)
!152 = !{!153, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_addr", scope: !151, file: !8, line: 21, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_sockaddr", file: !8, line: 12, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "p_remote_addr", scope: !151, file: !8, line: 22, baseType: !154, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_line_buf", scope: !151, file: !8, line: 23, baseType: !16, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !151, file: !8, line: 24, baseType: !19, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data_timeout", scope: !151, file: !8, line: 25, baseType: !19, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_listen_fd", scope: !151, file: !8, line: 28, baseType: !19, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "p_port_sockaddr", scope: !151, file: !8, line: 29, baseType: !154, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data_fd", scope: !151, file: !8, line: 30, baseType: !19, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data_progress", scope: !151, file: !8, line: 31, baseType: !19, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bw_rate_max", scope: !151, file: !8, line: 32, baseType: !26, size: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_sec", scope: !151, file: !8, line: 33, baseType: !28, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_usec", scope: !151, file: !8, line: 34, baseType: !28, size: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "is_anonymous", scope: !151, file: !8, line: 37, baseType: !19, size: 32, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "is_guest", scope: !151, file: !8, line: 38, baseType: !19, size: 32, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "user_str", scope: !151, file: !8, line: 39, baseType: !170, size: 128, offset: 704)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_buf", scope: !170, file: !34, line: 12, baseType: !16, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_len", scope: !170, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_bytes", scope: !170, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "anon_pass_str", scope: !151, file: !8, line: 40, baseType: !170, size: 128, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "restart_pos", scope: !151, file: !8, line: 43, baseType: !41, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "is_ascii", scope: !151, file: !8, line: 44, baseType: !19, size: 32, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rnfr_filename_str", scope: !151, file: !8, line: 45, baseType: !170, size: 128, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "abor_received", scope: !151, file: !8, line: 46, baseType: !19, size: 32, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "epsv_all", scope: !151, file: !8, line: 47, baseType: !19, size: 32, offset: 1248)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "is_http", scope: !151, file: !8, line: 50, baseType: !19, size: 32, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "http_get_arg", scope: !151, file: !8, line: 51, baseType: !170, size: 128, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "p_visited_dir_list", scope: !151, file: !8, line: 54, baseType: !51, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "anon_ftp_uid", scope: !151, file: !8, line: 57, baseType: !19, size: 32, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "guest_user_uid", scope: !151, file: !8, line: 58, baseType: !19, size: 32, offset: 1568)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "anon_upload_chown_uid", scope: !151, file: !8, line: 59, baseType: !19, size: 32, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "banned_email_str", scope: !151, file: !8, line: 62, baseType: !170, size: 128, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "email_passwords_str", scope: !151, file: !8, line: 63, baseType: !170, size: 128, offset: 1792)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "userlist_str", scope: !151, file: !8, line: 64, baseType: !170, size: 128, offset: 1920)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "banner_str", scope: !151, file: !8, line: 65, baseType: !170, size: 128, offset: 2048)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_wrapper_ok", scope: !151, file: !8, line: 66, baseType: !19, size: 32, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "xferlog_fd", scope: !151, file: !8, line: 69, baseType: !19, size: 32, offset: 2208)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vsftpd_log_fd", scope: !151, file: !8, line: 70, baseType: !19, size: 32, offset: 2240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip_str", scope: !151, file: !8, line: 71, baseType: !170, size: 128, offset: 2304)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "log_type", scope: !151, file: !8, line: 72, baseType: !65, size: 64, offset: 2432)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_sec", scope: !151, file: !8, line: 73, baseType: !28, size: 64, offset: 2496)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_usec", scope: !151, file: !8, line: 74, baseType: !28, size: 64, offset: 2560)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "log_str", scope: !151, file: !8, line: 75, baseType: !170, size: 128, offset: 2624)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_size", scope: !151, file: !8, line: 76, baseType: !41, size: 64, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_cmd_str", scope: !151, file: !8, line: 79, baseType: !170, size: 128, offset: 2816)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_arg_str", scope: !151, file: !8, line: 80, baseType: !170, size: 128, offset: 2944)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent_fd", scope: !151, file: !8, line: 83, baseType: !19, size: 32, offset: 3072)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "child_fd", scope: !151, file: !8, line: 84, baseType: !19, size: 32, offset: 3104)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "num_clients", scope: !151, file: !8, line: 87, baseType: !26, size: 32, offset: 3136)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_this_ip", scope: !151, file: !8, line: 88, baseType: !26, size: 32, offset: 3168)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "home_str", scope: !151, file: !8, line: 89, baseType: !170, size: 128, offset: 3200)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "control_use_ssl", scope: !151, file: !8, line: 92, baseType: !19, size: 32, offset: 3328)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data_use_ssl", scope: !151, file: !8, line: 93, baseType: !19, size: 32, offset: 3360)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "p_ssl_ctx", scope: !151, file: !8, line: 94, baseType: !80, size: 64, offset: 3392)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_ssl", scope: !151, file: !8, line: 95, baseType: !80, size: 64, offset: 3456)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "p_data_ssl", scope: !151, file: !8, line: 96, baseType: !80, size: 64, offset: 3520)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "control_cert_digest", scope: !151, file: !8, line: 97, baseType: !170, size: 128, offset: 3584)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_active", scope: !151, file: !8, line: 98, baseType: !19, size: 32, offset: 3712)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_fd", scope: !151, file: !8, line: 99, baseType: !19, size: 32, offset: 3744)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_consumer_fd", scope: !151, file: !8, line: 100, baseType: !19, size: 32, offset: 3776)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "login_fails", scope: !151, file: !8, line: 101, baseType: !26, size: 32, offset: 3808)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !224, globals: !226)
!218 = !{!113, !92, !219}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EVSFSysStrOpenMode", file: !220, line: 18, size: 32, elements: !221)
!220 = !DIFile(filename: "./sysstr.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!221 = !{!222, !223}
!222 = !DIEnumerator(name: "kVSFSysStrOpenUnknown", value: 0)
!223 = !DIEnumerator(name: "kVSFSysStrOpenReadOnly", value: 1)
!224 = !{!65, !225, !150}
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !{!144, !227, !229, !231, !233, !236, !238, !244, !246, !251, !253, !256, !260, !265, !270, !272, !274, !276, !279, !281, !288, !290, !293, !295, !298, !301, !304, !307, !309, !312, !317, !320, !323, !325, !327, !330, !332}
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "s_rhs_str", scope: !146, file: !147, line: 144, type: !170, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "s_src_str", scope: !146, file: !147, line: 163, type: !170, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "s_rhs_str", scope: !146, file: !147, line: 164, type: !170, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "s_cwd_buf_mangle_str", scope: !235, file: !147, line: 470, type: !170, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "handle_pwd", scope: !147, file: !147, line: 468, type: !148, scopeLine: 469, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "s_pwd_res_str", scope: !235, file: !147, line: 471, type: !170, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "s_rhs_str", scope: !240, file: !147, line: 1922, type: !170, isLocal: true, isDefinition: true)
!240 = distinct !DISubprogram(name: "resolve_tilde", scope: !147, file: !147, line: 1917, type: !241, scopeLine: 1918, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243, !150}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "s_user_str", scope: !240, file: !147, line: 1931, type: !170, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "s_pasv_res_str", scope: !248, file: !147, line: 572, type: !170, isLocal: true, isDefinition: true)
!248 = distinct !DISubprogram(name: "handle_pasv", scope: !147, file: !147, line: 569, type: !249, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !150, !19}
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "s_p_sockaddr", scope: !248, file: !147, line: 573, type: !154, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "s_mark_str", scope: !255, file: !147, line: 652, type: !170, isLocal: true, isDefinition: true)
!255 = distinct !DISubprogram(name: "handle_retr", scope: !147, file: !147, line: 650, type: !249, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !255, file: !147, line: 653, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_statbuf", file: !220, line: 6, flags: DIFlagFwdDecl)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "s_tmp_str", scope: !262, file: !147, line: 1364, type: !170, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "prepend_path_to_filename", scope: !147, file: !147, line: 1362, type: !263, scopeLine: 1363, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !243}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "s_option_str", scope: !267, file: !147, line: 803, type: !170, isLocal: true, isDefinition: true)
!267 = distinct !DISubprogram(name: "handle_dir_common", scope: !147, file: !147, line: 801, type: !268, scopeLine: 802, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !150, !19, !19}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "s_filter_str", scope: !267, file: !147, line: 804, type: !170, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "s_dir_name_str", scope: !267, file: !147, line: 805, type: !170, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "s_p_dirstat", scope: !267, file: !147, line: 806, type: !258, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !278, file: !147, line: 1018, type: !258, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "handle_upload_common", scope: !147, file: !147, line: 1016, type: !268, scopeLine: 1017, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "s_filename", scope: !278, file: !147, line: 1019, type: !170, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !283, file: !147, line: 1790, type: !258, isLocal: true, isDefinition: true)
!283 = distinct !DISubprogram(name: "get_unique_filename", scope: !147, file: !147, line: 1785, type: !284, scopeLine: 1786, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !243, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "s_stou_str", scope: !283, file: !147, line: 1791, type: !170, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s_mkd_res", scope: !292, file: !147, line: 1198, type: !170, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "handle_mkd", scope: !147, file: !147, line: 1176, type: !148, scopeLine: 1177, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "s_tmp_str", scope: !292, file: !147, line: 1199, type: !170, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "s_rest_str", scope: !297, file: !147, line: 1267, type: !170, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "handle_rest", scope: !147, file: !147, line: 1265, type: !148, scopeLine: 1266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "p_statbuf", scope: !300, file: !147, line: 1283, type: !258, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "handle_rnfr", scope: !147, file: !147, line: 1281, type: !148, scopeLine: 1282, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "s_tmp_str", scope: !303, file: !147, line: 1316, type: !170, isLocal: true, isDefinition: true)
!303 = distinct !DISubprogram(name: "handle_rnto", scope: !147, file: !147, line: 1314, type: !148, scopeLine: 1315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !306, file: !147, line: 1476, type: !258, isLocal: true, isDefinition: true)
!306 = distinct !DISubprogram(name: "handle_size", scope: !147, file: !147, line: 1469, type: !148, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "s_size_res_str", scope: !306, file: !147, line: 1491, type: !170, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "s_site_args_str", scope: !311, file: !147, line: 1501, type: !170, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "handle_site", scope: !147, file: !147, line: 1499, type: !148, scopeLine: 1500, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "s_chmod_file_str", scope: !314, file: !147, line: 1536, type: !170, isLocal: true, isDefinition: true)
!314 = distinct !DISubprogram(name: "handle_site_chmod", scope: !147, file: !147, line: 1534, type: !315, scopeLine: 1535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !150, !243}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "s_umask_resp_str", scope: !319, file: !147, line: 1578, type: !170, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "handle_site_umask", scope: !147, file: !147, line: 1576, type: !315, scopeLine: 1577, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "s_filename_str", scope: !322, file: !147, line: 1607, type: !170, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "handle_mdtm", scope: !147, file: !147, line: 1605, type: !148, scopeLine: 1606, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !322, file: !147, line: 1608, type: !258, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "s_mdtm_res_str", scope: !322, file: !147, line: 1668, type: !170, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "s_part1_str", scope: !329, file: !147, line: 1680, type: !170, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "handle_eprt", scope: !147, file: !147, line: 1678, type: !148, scopeLine: 1679, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !128)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "s_part2_str", scope: !329, file: !147, line: 1681, type: !170, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "s_scopeid_str", scope: !329, file: !147, line: 1682, type: !170, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "tunable_anonymous_enable", scope: !336, file: !337, line: 11, type: !19, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !128, retainedTypes: !338, globals: !339)
!337 = !DIFile(filename: "tunables.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!338 = !{!16}
!339 = !{!334, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !584, !586, !588, !590, !592, !594, !596, !598, !600}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "tunable_local_enable", scope: !336, file: !337, line: 12, type: !19, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "tunable_pasv_enable", scope: !336, file: !337, line: 13, type: !19, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "tunable_port_enable", scope: !336, file: !337, line: 14, type: !19, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "tunable_chroot_local_user", scope: !336, file: !337, line: 15, type: !19, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "tunable_write_enable", scope: !336, file: !337, line: 16, type: !19, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "tunable_anon_upload_enable", scope: !336, file: !337, line: 17, type: !19, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "tunable_anon_mkdir_write_enable", scope: !336, file: !337, line: 18, type: !19, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "tunable_anon_other_write_enable", scope: !336, file: !337, line: 19, type: !19, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "tunable_chown_uploads", scope: !336, file: !337, line: 20, type: !19, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "tunable_connect_from_port_20", scope: !336, file: !337, line: 21, type: !19, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "tunable_xferlog_enable", scope: !336, file: !337, line: 22, type: !19, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "tunable_dirmessage_enable", scope: !336, file: !337, line: 23, type: !19, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "tunable_anon_world_readable_only", scope: !336, file: !337, line: 24, type: !19, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "tunable_async_abor_enable", scope: !336, file: !337, line: 25, type: !19, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "tunable_ascii_upload_enable", scope: !336, file: !337, line: 26, type: !19, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "tunable_ascii_download_enable", scope: !336, file: !337, line: 27, type: !19, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "tunable_one_process_model", scope: !336, file: !337, line: 28, type: !19, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "tunable_xferlog_std_format", scope: !336, file: !337, line: 29, type: !19, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "tunable_pasv_promiscuous", scope: !336, file: !337, line: 30, type: !19, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "tunable_deny_email_enable", scope: !336, file: !337, line: 31, type: !19, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "tunable_chroot_list_enable", scope: !336, file: !337, line: 32, type: !19, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "tunable_setproctitle_enable", scope: !336, file: !337, line: 33, type: !19, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "tunable_text_userdb_names", scope: !336, file: !337, line: 34, type: !19, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "tunable_ls_recurse_enable", scope: !336, file: !337, line: 35, type: !19, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "tunable_log_ftp_protocol", scope: !336, file: !337, line: 36, type: !19, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "tunable_guest_enable", scope: !336, file: !337, line: 37, type: !19, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "tunable_userlist_enable", scope: !336, file: !337, line: 38, type: !19, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "tunable_userlist_deny", scope: !336, file: !337, line: 39, type: !19, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "tunable_use_localtime", scope: !336, file: !337, line: 40, type: !19, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "tunable_check_shell", scope: !336, file: !337, line: 41, type: !19, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "tunable_hide_ids", scope: !336, file: !337, line: 42, type: !19, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "tunable_listen", scope: !336, file: !337, line: 43, type: !19, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "tunable_port_promiscuous", scope: !336, file: !337, line: 44, type: !19, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "tunable_passwd_chroot_enable", scope: !336, file: !337, line: 45, type: !19, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "tunable_no_anon_password", scope: !336, file: !337, line: 46, type: !19, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "tunable_tcp_wrappers", scope: !336, file: !337, line: 47, type: !19, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "tunable_use_sendfile", scope: !336, file: !337, line: 48, type: !19, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "tunable_force_dot_files", scope: !336, file: !337, line: 49, type: !19, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "tunable_listen_ipv6", scope: !336, file: !337, line: 50, type: !19, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "tunable_dual_log_enable", scope: !336, file: !337, line: 51, type: !19, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "tunable_syslog_enable", scope: !336, file: !337, line: 52, type: !19, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "tunable_background", scope: !336, file: !337, line: 53, type: !19, isLocal: false, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "tunable_virtual_use_local_privs", scope: !336, file: !337, line: 54, type: !19, isLocal: false, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "tunable_session_support", scope: !336, file: !337, line: 55, type: !19, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "tunable_download_enable", scope: !336, file: !337, line: 56, type: !19, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "tunable_dirlist_enable", scope: !336, file: !337, line: 57, type: !19, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "tunable_chmod_enable", scope: !336, file: !337, line: 58, type: !19, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "tunable_secure_email_list_enable", scope: !336, file: !337, line: 59, type: !19, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "tunable_run_as_launching_user", scope: !336, file: !337, line: 60, type: !19, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "tunable_no_log_lock", scope: !336, file: !337, line: 61, type: !19, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "tunable_ssl_enable", scope: !336, file: !337, line: 62, type: !19, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "tunable_allow_anon_ssl", scope: !336, file: !337, line: 63, type: !19, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "tunable_force_local_logins_ssl", scope: !336, file: !337, line: 64, type: !19, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "tunable_force_local_data_ssl", scope: !336, file: !337, line: 65, type: !19, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "tunable_sslv2", scope: !336, file: !337, line: 66, type: !19, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "tunable_sslv3", scope: !336, file: !337, line: 67, type: !19, isLocal: false, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "tunable_tlsv1", scope: !336, file: !337, line: 68, type: !19, isLocal: false, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "tunable_tilde_user_enable", scope: !336, file: !337, line: 69, type: !19, isLocal: false, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "tunable_force_anon_logins_ssl", scope: !336, file: !337, line: 70, type: !19, isLocal: false, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "tunable_force_anon_data_ssl", scope: !336, file: !337, line: 71, type: !19, isLocal: false, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "tunable_mdtm_write", scope: !336, file: !337, line: 72, type: !19, isLocal: false, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "tunable_lock_upload_files", scope: !336, file: !337, line: 73, type: !19, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "tunable_pasv_addr_resolve", scope: !336, file: !337, line: 74, type: !19, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "tunable_debug_ssl", scope: !336, file: !337, line: 75, type: !19, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "tunable_require_cert", scope: !336, file: !337, line: 76, type: !19, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "tunable_validate_cert", scope: !336, file: !337, line: 77, type: !19, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "tunable_strict_ssl_read_eof", scope: !336, file: !337, line: 78, type: !19, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "tunable_strict_ssl_write_shutdown", scope: !336, file: !337, line: 79, type: !19, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "tunable_ssl_request_cert", scope: !336, file: !337, line: 80, type: !19, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "tunable_delete_failed_uploads", scope: !336, file: !337, line: 81, type: !19, isLocal: false, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "tunable_implicit_ssl", scope: !336, file: !337, line: 82, type: !19, isLocal: false, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "tunable_ptrace_sandbox", scope: !336, file: !337, line: 83, type: !19, isLocal: false, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "tunable_require_ssl_reuse", scope: !336, file: !337, line: 84, type: !19, isLocal: false, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "tunable_isolate", scope: !336, file: !337, line: 85, type: !19, isLocal: false, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "tunable_isolate_network", scope: !336, file: !337, line: 86, type: !19, isLocal: false, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "tunable_ftp_enable", scope: !336, file: !337, line: 87, type: !19, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "tunable_http_enable", scope: !336, file: !337, line: 88, type: !19, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "tunable_seccomp_sandbox", scope: !336, file: !337, line: 89, type: !19, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "tunable_allow_writeable_chroot", scope: !336, file: !337, line: 90, type: !19, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "tunable_accept_timeout", scope: !336, file: !337, line: 92, type: !26, isLocal: false, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "tunable_connect_timeout", scope: !336, file: !337, line: 93, type: !26, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "tunable_local_umask", scope: !336, file: !337, line: 94, type: !26, isLocal: false, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "tunable_anon_umask", scope: !336, file: !337, line: 95, type: !26, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "tunable_ftp_data_port", scope: !336, file: !337, line: 96, type: !26, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "tunable_idle_session_timeout", scope: !336, file: !337, line: 97, type: !26, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "tunable_data_connection_timeout", scope: !336, file: !337, line: 98, type: !26, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "tunable_pasv_min_port", scope: !336, file: !337, line: 99, type: !26, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "tunable_pasv_max_port", scope: !336, file: !337, line: 100, type: !26, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "tunable_anon_max_rate", scope: !336, file: !337, line: 101, type: !26, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "tunable_local_max_rate", scope: !336, file: !337, line: 102, type: !26, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "tunable_listen_port", scope: !336, file: !337, line: 103, type: !26, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "tunable_max_clients", scope: !336, file: !337, line: 104, type: !26, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "tunable_file_open_mode", scope: !336, file: !337, line: 105, type: !26, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "tunable_max_per_ip", scope: !336, file: !337, line: 106, type: !26, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "tunable_trans_chunk_size", scope: !336, file: !337, line: 107, type: !26, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "tunable_delay_failed_login", scope: !336, file: !337, line: 108, type: !26, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "tunable_delay_successful_login", scope: !336, file: !337, line: 109, type: !26, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "tunable_max_login_fails", scope: !336, file: !337, line: 110, type: !26, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "tunable_chown_upload_mode", scope: !336, file: !337, line: 111, type: !26, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "tunable_secure_chroot_dir", scope: !336, file: !337, line: 113, type: !88, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "tunable_ftp_username", scope: !336, file: !337, line: 114, type: !88, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "tunable_chown_username", scope: !336, file: !337, line: 115, type: !88, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "tunable_xferlog_file", scope: !336, file: !337, line: 116, type: !88, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "tunable_vsftpd_log_file", scope: !336, file: !337, line: 117, type: !88, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "tunable_message_file", scope: !336, file: !337, line: 118, type: !88, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "tunable_nopriv_user", scope: !336, file: !337, line: 119, type: !88, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "tunable_ftpd_banner", scope: !336, file: !337, line: 120, type: !88, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "tunable_banned_email_file", scope: !336, file: !337, line: 121, type: !88, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "tunable_chroot_list_file", scope: !336, file: !337, line: 122, type: !88, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "tunable_pam_service_name", scope: !336, file: !337, line: 123, type: !88, isLocal: false, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "tunable_guest_username", scope: !336, file: !337, line: 124, type: !88, isLocal: false, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "tunable_userlist_file", scope: !336, file: !337, line: 125, type: !88, isLocal: false, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "tunable_anon_root", scope: !336, file: !337, line: 126, type: !88, isLocal: false, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "tunable_local_root", scope: !336, file: !337, line: 127, type: !88, isLocal: false, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "tunable_banner_file", scope: !336, file: !337, line: 128, type: !88, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "tunable_pasv_address", scope: !336, file: !337, line: 129, type: !88, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "tunable_listen_address", scope: !336, file: !337, line: 130, type: !88, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "tunable_user_config_dir", scope: !336, file: !337, line: 131, type: !88, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "tunable_listen_address6", scope: !336, file: !337, line: 132, type: !88, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "tunable_cmds_allowed", scope: !336, file: !337, line: 133, type: !88, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "tunable_cmds_denied", scope: !336, file: !337, line: 134, type: !88, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "tunable_hide_file", scope: !336, file: !337, line: 135, type: !88, isLocal: false, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "tunable_deny_file", scope: !336, file: !337, line: 136, type: !88, isLocal: false, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "tunable_user_sub_token", scope: !336, file: !337, line: 137, type: !88, isLocal: false, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "tunable_email_password_file", scope: !336, file: !337, line: 138, type: !88, isLocal: false, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "tunable_rsa_cert_file", scope: !336, file: !337, line: 139, type: !88, isLocal: false, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "tunable_dsa_cert_file", scope: !336, file: !337, line: 140, type: !88, isLocal: false, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "tunable_ssl_ciphers", scope: !336, file: !337, line: 141, type: !88, isLocal: false, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "tunable_rsa_private_key_file", scope: !336, file: !337, line: 142, type: !88, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "tunable_dsa_private_key_file", scope: !336, file: !337, line: 143, type: !88, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "tunable_ca_certs_file", scope: !336, file: !337, line: 144, type: !88, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "p_recvbuf", scope: !604, file: !605, line: 592, type: !16, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "do_file_recv", scope: !605, file: !605, line: 590, type: !606, scopeLine: 591, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !689, retainedNodes: !128)
!605 = !DIFile(filename: "ftpdataio.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !613, !19, !19}
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_transfer_ret", file: !609, line: 72, size: 128, elements: !610)
!609 = !DIFile(filename: "./ftpdataio.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !608, file: !609, line: 74, baseType: !19, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "transferred", scope: !608, file: !609, line: 75, baseType: !41, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_session", file: !8, line: 18, size: 3840, elements: !615)
!615 = !{!616, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !638, !639, !640, !641, !642, !643, !644, !645, !646, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_addr", scope: !614, file: !8, line: 21, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_sockaddr", file: !609, line: 7, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "p_remote_addr", scope: !614, file: !8, line: 22, baseType: !617, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_line_buf", scope: !614, file: !8, line: 23, baseType: !16, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !614, file: !8, line: 24, baseType: !19, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data_timeout", scope: !614, file: !8, line: 25, baseType: !19, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_listen_fd", scope: !614, file: !8, line: 28, baseType: !19, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "p_port_sockaddr", scope: !614, file: !8, line: 29, baseType: !617, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data_fd", scope: !614, file: !8, line: 30, baseType: !19, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "data_progress", scope: !614, file: !8, line: 31, baseType: !19, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bw_rate_max", scope: !614, file: !8, line: 32, baseType: !26, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_sec", scope: !614, file: !8, line: 33, baseType: !28, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_usec", scope: !614, file: !8, line: 34, baseType: !28, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "is_anonymous", scope: !614, file: !8, line: 37, baseType: !19, size: 32, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "is_guest", scope: !614, file: !8, line: 38, baseType: !19, size: 32, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "user_str", scope: !614, file: !8, line: 39, baseType: !633, size: 128, offset: 704)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_buf", scope: !633, file: !34, line: 12, baseType: !16, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_len", scope: !633, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_bytes", scope: !633, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "anon_pass_str", scope: !614, file: !8, line: 40, baseType: !633, size: 128, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "restart_pos", scope: !614, file: !8, line: 43, baseType: !41, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "is_ascii", scope: !614, file: !8, line: 44, baseType: !19, size: 32, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rnfr_filename_str", scope: !614, file: !8, line: 45, baseType: !633, size: 128, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "abor_received", scope: !614, file: !8, line: 46, baseType: !19, size: 32, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "epsv_all", scope: !614, file: !8, line: 47, baseType: !19, size: 32, offset: 1248)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "is_http", scope: !614, file: !8, line: 50, baseType: !19, size: 32, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "http_get_arg", scope: !614, file: !8, line: 51, baseType: !633, size: 128, offset: 1344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "p_visited_dir_list", scope: !614, file: !8, line: 54, baseType: !647, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr_list", file: !649, line: 8, size: 128, elements: !650)
!649 = !DIFile(filename: "./strlist.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_len", scope: !648, file: !649, line: 10, baseType: !26, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_list_len", scope: !648, file: !649, line: 11, baseType: !26, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_nodes", scope: !648, file: !649, line: 12, baseType: !654, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "mystr_list_node", file: !649, line: 6, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "anon_ftp_uid", scope: !614, file: !8, line: 57, baseType: !19, size: 32, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "guest_user_uid", scope: !614, file: !8, line: 58, baseType: !19, size: 32, offset: 1568)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "anon_upload_chown_uid", scope: !614, file: !8, line: 59, baseType: !19, size: 32, offset: 1600)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "banned_email_str", scope: !614, file: !8, line: 62, baseType: !633, size: 128, offset: 1664)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "email_passwords_str", scope: !614, file: !8, line: 63, baseType: !633, size: 128, offset: 1792)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "userlist_str", scope: !614, file: !8, line: 64, baseType: !633, size: 128, offset: 1920)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "banner_str", scope: !614, file: !8, line: 65, baseType: !633, size: 128, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_wrapper_ok", scope: !614, file: !8, line: 66, baseType: !19, size: 32, offset: 2176)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "xferlog_fd", scope: !614, file: !8, line: 69, baseType: !19, size: 32, offset: 2208)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vsftpd_log_fd", scope: !614, file: !8, line: 70, baseType: !19, size: 32, offset: 2240)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip_str", scope: !614, file: !8, line: 71, baseType: !633, size: 128, offset: 2304)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "log_type", scope: !614, file: !8, line: 72, baseType: !65, size: 64, offset: 2432)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_sec", scope: !614, file: !8, line: 73, baseType: !28, size: 64, offset: 2496)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_usec", scope: !614, file: !8, line: 74, baseType: !28, size: 64, offset: 2560)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "log_str", scope: !614, file: !8, line: 75, baseType: !633, size: 128, offset: 2624)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_size", scope: !614, file: !8, line: 76, baseType: !41, size: 64, offset: 2752)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_cmd_str", scope: !614, file: !8, line: 79, baseType: !633, size: 128, offset: 2816)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_arg_str", scope: !614, file: !8, line: 80, baseType: !633, size: 128, offset: 2944)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "parent_fd", scope: !614, file: !8, line: 83, baseType: !19, size: 32, offset: 3072)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "child_fd", scope: !614, file: !8, line: 84, baseType: !19, size: 32, offset: 3104)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "num_clients", scope: !614, file: !8, line: 87, baseType: !26, size: 32, offset: 3136)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "num_this_ip", scope: !614, file: !8, line: 88, baseType: !26, size: 32, offset: 3168)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "home_str", scope: !614, file: !8, line: 89, baseType: !633, size: 128, offset: 3200)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "control_use_ssl", scope: !614, file: !8, line: 92, baseType: !19, size: 32, offset: 3328)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data_use_ssl", scope: !614, file: !8, line: 93, baseType: !19, size: 32, offset: 3360)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "p_ssl_ctx", scope: !614, file: !8, line: 94, baseType: !80, size: 64, offset: 3392)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_ssl", scope: !614, file: !8, line: 95, baseType: !80, size: 64, offset: 3456)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "p_data_ssl", scope: !614, file: !8, line: 96, baseType: !80, size: 64, offset: 3520)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "control_cert_digest", scope: !614, file: !8, line: 97, baseType: !633, size: 128, offset: 3584)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_active", scope: !614, file: !8, line: 98, baseType: !19, size: 32, offset: 3712)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_fd", scope: !614, file: !8, line: 99, baseType: !19, size: 32, offset: 3744)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_consumer_fd", scope: !614, file: !8, line: 100, baseType: !19, size: 32, offset: 3776)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "login_fails", scope: !614, file: !8, line: 101, baseType: !26, size: 32, offset: 3808)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !690, retainedTypes: !691, globals: !693)
!690 = !{!113, !108}
!691 = !{!613, !692, !26}
!692 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!693 = !{!694, !697, !699, !602}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "p_readbuf", scope: !696, file: !605, line: 467, type: !16, isLocal: true, isDefinition: true)
!696 = distinct !DISubprogram(name: "do_file_send_rwloop", scope: !605, file: !605, line: 465, type: !606, scopeLine: 466, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !689, retainedNodes: !128)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "p_asciibuf", scope: !696, file: !605, line: 468, type: !16, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !701, file: !605, line: 568, type: !704, isLocal: true, isDefinition: true)
!701 = distinct !DISubprogram(name: "calc_num_send", scope: !605, file: !605, line: 566, type: !702, scopeLine: 567, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !689, retainedNodes: !128)
!702 = !DISubroutineType(types: !703)
!703 = !{!41, !19, !41}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_statbuf", file: !13, line: 111, flags: DIFlagFwdDecl)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "s_next_filename_str", scope: !708, file: !709, line: 91, type: !723, isLocal: true, isDefinition: true)
!708 = distinct !DISubprogram(name: "vsf_ls_populate_dir_list", scope: !709, file: !709, line: 25, type: !710, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !728, retainedNodes: !128)
!709 = !DIFile(filename: "ls.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712, !712, !718, !721, !721, !721, !19}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr_list", file: !649, line: 8, size: 128, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_len", scope: !713, file: !649, line: 10, baseType: !26, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_list_len", scope: !713, file: !649, line: 11, baseType: !26, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_nodes", scope: !713, file: !649, line: 12, baseType: !654, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_sysutil_dir", file: !720, line: 6, flags: DIFlagFwdDecl)
!720 = !DIFile(filename: "./ls.h", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_buf", scope: !723, file: !34, line: 12, baseType: !16, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_len", scope: !723, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_bytes", scope: !723, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !128, retainedTypes: !729, globals: !730)
!729 = !{!65}
!730 = !{!706, !731, !733, !735, !737, !739, !741, !747}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "s_next_path_and_filename_str", scope: !708, file: !709, line: 92, type: !723, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "s_p_statbuf", scope: !708, file: !709, line: 93, type: !258, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "s_final_file_str", scope: !708, file: !709, line: 149, type: !723, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "s_temp_str", scope: !708, file: !709, line: 154, type: !723, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "s_temp_str", scope: !708, file: !709, line: 192, type: !723, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "s_match_needed_str", scope: !743, file: !709, line: 254, type: !723, isLocal: true, isDefinition: true)
!743 = distinct !DISubprogram(name: "vsf_filename_passes_filter", scope: !709, file: !709, line: 223, type: !744, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !728, retainedNodes: !128)
!744 = !DISubroutineType(types: !745)
!745 = !{!19, !721, !721, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "s_tmp_str", scope: !749, file: !709, line: 375, type: !723, isLocal: true, isDefinition: true)
!749 = distinct !DISubprogram(name: "build_dir_line", scope: !709, file: !709, line: 372, type: !750, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !728, retainedNodes: !128)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !752, !721, !753, !28}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "s_log_str", scope: !757, file: !758, line: 134, type: !779, isLocal: true, isDefinition: true)
!757 = distinct !DISubprogram(name: "vsf_log_common", scope: !758, file: !758, line: 131, type: !759, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, retainedNodes: !128)
!758 = !DIFile(filename: "logging.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!759 = !DISubroutineType(types: !760)
!760 = !{null, !761, !19, !92, !826}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vsf_session", file: !8, line: 18, size: 3840, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_addr", scope: !762, file: !8, line: 21, baseType: !11, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_remote_addr", scope: !762, file: !8, line: 22, baseType: !11, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_line_buf", scope: !762, file: !8, line: 23, baseType: !16, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !762, file: !8, line: 24, baseType: !19, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data_timeout", scope: !762, file: !8, line: 25, baseType: !19, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_listen_fd", scope: !762, file: !8, line: 28, baseType: !19, size: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "p_port_sockaddr", scope: !762, file: !8, line: 29, baseType: !11, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data_fd", scope: !762, file: !8, line: 30, baseType: !19, size: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data_progress", scope: !762, file: !8, line: 31, baseType: !19, size: 32, offset: 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bw_rate_max", scope: !762, file: !8, line: 32, baseType: !26, size: 32, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_sec", scope: !762, file: !8, line: 33, baseType: !28, size: 64, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bw_send_start_usec", scope: !762, file: !8, line: 34, baseType: !28, size: 64, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "is_anonymous", scope: !762, file: !8, line: 37, baseType: !19, size: 32, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "is_guest", scope: !762, file: !8, line: 38, baseType: !19, size: 32, offset: 672)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "user_str", scope: !762, file: !8, line: 39, baseType: !779, size: 128, offset: 704)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_p_buf", scope: !779, file: !34, line: 12, baseType: !16, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_len", scope: !779, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "PRIVATE_HANDS_OFF_alloc_bytes", scope: !779, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "anon_pass_str", scope: !762, file: !8, line: 40, baseType: !779, size: 128, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "restart_pos", scope: !762, file: !8, line: 43, baseType: !41, size: 64, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_ascii", scope: !762, file: !8, line: 44, baseType: !19, size: 32, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rnfr_filename_str", scope: !762, file: !8, line: 45, baseType: !779, size: 128, offset: 1088)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "abor_received", scope: !762, file: !8, line: 46, baseType: !19, size: 32, offset: 1216)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "epsv_all", scope: !762, file: !8, line: 47, baseType: !19, size: 32, offset: 1248)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "is_http", scope: !762, file: !8, line: 50, baseType: !19, size: 32, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "http_get_arg", scope: !762, file: !8, line: 51, baseType: !779, size: 128, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "p_visited_dir_list", scope: !762, file: !8, line: 54, baseType: !51, size: 64, offset: 1472)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "anon_ftp_uid", scope: !762, file: !8, line: 57, baseType: !19, size: 32, offset: 1536)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "guest_user_uid", scope: !762, file: !8, line: 58, baseType: !19, size: 32, offset: 1568)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "anon_upload_chown_uid", scope: !762, file: !8, line: 59, baseType: !19, size: 32, offset: 1600)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "banned_email_str", scope: !762, file: !8, line: 62, baseType: !779, size: 128, offset: 1664)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "email_passwords_str", scope: !762, file: !8, line: 63, baseType: !779, size: 128, offset: 1792)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "userlist_str", scope: !762, file: !8, line: 64, baseType: !779, size: 128, offset: 1920)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "banner_str", scope: !762, file: !8, line: 65, baseType: !779, size: 128, offset: 2048)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_wrapper_ok", scope: !762, file: !8, line: 66, baseType: !19, size: 32, offset: 2176)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "xferlog_fd", scope: !762, file: !8, line: 69, baseType: !19, size: 32, offset: 2208)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vsftpd_log_fd", scope: !762, file: !8, line: 70, baseType: !19, size: 32, offset: 2240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip_str", scope: !762, file: !8, line: 71, baseType: !779, size: 128, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "log_type", scope: !762, file: !8, line: 72, baseType: !65, size: 64, offset: 2432)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_sec", scope: !762, file: !8, line: 73, baseType: !28, size: 64, offset: 2496)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "log_start_usec", scope: !762, file: !8, line: 74, baseType: !28, size: 64, offset: 2560)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "log_str", scope: !762, file: !8, line: 75, baseType: !779, size: 128, offset: 2624)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_size", scope: !762, file: !8, line: 76, baseType: !41, size: 64, offset: 2752)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_cmd_str", scope: !762, file: !8, line: 79, baseType: !779, size: 128, offset: 2816)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_arg_str", scope: !762, file: !8, line: 80, baseType: !779, size: 128, offset: 2944)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "parent_fd", scope: !762, file: !8, line: 83, baseType: !19, size: 32, offset: 3072)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "child_fd", scope: !762, file: !8, line: 84, baseType: !19, size: 32, offset: 3104)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "num_clients", scope: !762, file: !8, line: 87, baseType: !26, size: 32, offset: 3136)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num_this_ip", scope: !762, file: !8, line: 88, baseType: !26, size: 32, offset: 3168)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "home_str", scope: !762, file: !8, line: 89, baseType: !779, size: 128, offset: 3200)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "control_use_ssl", scope: !762, file: !8, line: 92, baseType: !19, size: 32, offset: 3328)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data_use_ssl", scope: !762, file: !8, line: 93, baseType: !19, size: 32, offset: 3360)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "p_ssl_ctx", scope: !762, file: !8, line: 94, baseType: !80, size: 64, offset: 3392)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "p_control_ssl", scope: !762, file: !8, line: 95, baseType: !80, size: 64, offset: 3456)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p_data_ssl", scope: !762, file: !8, line: 96, baseType: !80, size: 64, offset: 3520)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "control_cert_digest", scope: !762, file: !8, line: 97, baseType: !779, size: 128, offset: 3584)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_active", scope: !762, file: !8, line: 98, baseType: !19, size: 32, offset: 3712)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_slave_fd", scope: !762, file: !8, line: 99, baseType: !19, size: 32, offset: 3744)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_consumer_fd", scope: !762, file: !8, line: 100, baseType: !19, size: 32, offset: 3776)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "login_fails", scope: !762, file: !8, line: 101, baseType: !26, size: 32, offset: 3808)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !830, globals: !831)
!829 = !{!92}
!830 = !{!65, !92, !692}
!831 = !{!755, !832}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "s_filename_str", scope: !834, file: !758, line: 185, type: !779, isLocal: true, isDefinition: true)
!834 = distinct !DISubprogram(name: "vsf_log_do_log_wuftpd_format", scope: !758, file: !758, line: 182, type: !835, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !828, retainedNodes: !128)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !761, !837, !19}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "s_tmp_str", scope: !840, file: !841, line: 314, type: !845, isLocal: true, isDefinition: true)
!840 = distinct !DISubprogram(name: "str_lpad", scope: !841, file: !841, line: 312, type: !842, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !851, retainedNodes: !128)
!841 = !DIFile(filename: "str.c", directory: "/home/byshen/clang_files/llvm-9.0.0.src/lib/Transforms/AceInstrument/software/vsftpd/vsftpd-3.0.3")
!842 = !DISubroutineType(types: !843)
!843 = !{null, !844, !850}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mystr", file: !34, line: 10, size: 128, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "p_buf", scope: !845, file: !34, line: 12, baseType: !16, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !845, file: !34, line: 14, baseType: !26, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_bytes", scope: !845, file: !34, line: 15, baseType: !26, size: 32, offset: 96)
